
struct StudentInfo {
  // 学生姓名
  std::string name;
  // 学生年龄
  int age;
  // 学生成绩
  std::unordered_map<std::string, int> scores;
};

std::vector<StudentInfo> students = {
    {"张三", 20, {{"语文", 100}, {"数学", 98}, {"英语", 95}}},
    {"李四", 21, {{"语文", 90}, {"数学", 85}, {"英语", 92}}},
    {"王五", 22, {{"语文", 99}, {"数学", 98}, {"英语", 97}}},
    {"赵六", 23, {{"语文", 88}, {"数学", 85}, {"英语", 92}}},
    {"孙七", 24, {{"语文", 98}, {"数学", 95}, {"英语", 93}}},
    {"周八", 25, {{"语文", 90}, {"数学", 85}, {"英语", 92}}},
    {"吴九", 26, {{"语文", 99}, {"数学", 98}, {"英语", 97}}},
    {"郑十", 27, {{"语文", 88}, {"数学", 85}, {"英语", 92}}},
    {"王十一", 28, {{"语文", 98}, {"数学", 95}, {"英语", 93}}},
    {"李十二", 29, {{"语文", 90}, {"数学", 85}, {"英语", 92}}},
    {"张十三", 30, {{"语文", 99}, {"数学", 98}, {"英语", 97}}},
    {"李十四", 31, {{"语文", 88}, {"数学", 85}, {"英语", 92}}},
    {"王十五", 32, {{"语文", 98}, {"数学", 95}, {"英语", 93}}},
    {"赵十六", 33, {{"语文", 90}, {"数学", 85}, {"英语", 92}}},
    {}
};